Cylinder_snappyHexMesh/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    defaultFaces
    {
        type            empty;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
208
(
0.000998988
0.000998996
0.000998999
0.000998999
0.000998996
0.000998988
0.000998907
0.000998963
...
)
;
    }
    outlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
208
(
0.000998981
0.000998994
0.000998997
0.000998997
0.000998994
0.000998981
0.000998885
0.000998949
...
)
;
    }
}


// ************************************************************************* //
