Cylinder_snappyHexMesh/0/thicknessFraction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      thicknessFraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    defaultFaces
    {
        type            empty;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
208
(
0.999988
0.999996
0.999999
0.999999
0.999996
0.999988
0.999907
0.999963
...
)
;
    }
    outlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
208
(
0.999981
0.999994
0.999997
0.999997
0.999994
0.999981
0.999885
0.999949
...
)
;
    }
}


// ************************************************************************* //
